import pandas as pd
import pyperclip
# df = pd.read_excel('./db/order_all.xlsx')

# df = pd.DataFrame({
#     'name': ['小明', '小红'],
#     'home': ['南山', '宝安'],
#     'age': ['20', '18']
# })
#
# df.loc[len(df)] = ['小葱','龙华','21']
#
# print(df)

df = pd.DataFrame({
    '金香鸭屎':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g金香鸭屎
可享赠送1泡高山茶品鉴装
——————————————
https://item.taobao.com/item.htm?id=628822198422
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园鸭屎':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g庄园鸭屎
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=654182463436
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园东方红':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g庄园东方红
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=682193636745
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园蜜兰':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g庄园蜜兰
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=644064383516
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '清香桂花':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g清香桂花
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=739256979663
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园锯朵仔':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g庄园锯朵仔
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=737267365307
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '岽顶蜜兰香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g岽顶蜜兰香
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=828073420310
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '浓香芝兰':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g浓香芝兰
可享赠送1泡高山茶品鉴装
——————————————
https://item.taobao.com/item.htm?id=899425198003
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '四大老丛':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g四大老丛
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=659167123219
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房蜜兰香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房蜜兰
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=827705598336
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房宋种':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房宋种
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=688249683563
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房东方红':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房东方红
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=688248759258
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房八仙':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房八仙
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=687342356512
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房鸭屎香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房鸭屎
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=687341584840
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '十年陈窖藏鸭屎香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g十年陈窖藏鸭屎香
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=982387549302&skuId=5941095100496
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '十年陈窖藏蜜兰香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购500g十年陈窖藏蜜兰香
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=983057704946&skuId=6107976571455
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房凹富后':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房凹富后
可享赠送1泡老丛茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=981118963776&skuId=6108440979194
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '老丛私房姜花香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g老丛私房姜花香
可享赠送1泡老丛茶品鉴装
——————————————
https://item.taobao.com/item.htm?id=981085847139
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '悠山蜜兰':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g悠山蜜兰
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=644352213959
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '东方红韵':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购200g东方红韵
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=624538553891
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园鸭屎+岽顶蜜兰香':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购504g乌岽高山组合
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=741457546918
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '金香鸭屎+庄园蜜兰':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购504g浓淡组合
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=741371497304
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '庄园鸭屎+庄园锯朵仔':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购504g高山庄园组合
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=741581827746
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '金香鸭屎+清香桂花':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购504g高香组合
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=961726314432&skuId=5897430573526
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '六大香型300g':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购300g六大组合1.0
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=655477978907
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '六大香型进阶版':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购300g六大组合2.0
可享赠送1泡高山茶品鉴装
——————————————
https://item.taobao.com/item.htm?id=657559415607
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
    '九大香型':'''❤亲 快来领取您的老茶友福利👈
亲爱的茶友 /:008
感谢您在众多茶叶当中选择千庭
现在咱们有个老茶友专属优惠回馈
您复购450g九大组合
可享赠送1泡高山茶品鉴装
——————————————
https://detail.tmall.com/item.htm?id=657737278724
(推荐链接是您上次购买的同款)
——————————————
茶友，您这边下单之后
咱们给您备注好赠送品鉴装哈 /:071''',
},index=[0])
df.to_excel('./db/customer_push_table.xlsx')
# df = pd.read_excel('./db/customer_push_table.xlsx')
# print(df.loc[0 , '庄园鸭屎'])

# pyperclip.copy(df.loc[0 , '庄园鸭屎'])
