import json

word = ['金香鸭屎+庄园蜜兰','金香鸭屎+清香桂花','庄园鸭屎+岽顶蜜兰香','庄园鸭屎+庄园锯朵仔',
        '金香鸭屎','庄园鸭屎','庄园蜜兰','岽顶蜜兰香','浓香芝兰','庄园锯朵仔','清香鸭屎','清香桂花','庄园东方红','悠山蜜兰','老丛私房鸭屎香',
        '老丛私房蜜兰香','六大香型300g','六大香型进阶版','四大老丛','老丛私房八仙','老丛私房凹富后','老丛私房宋种','老丛私房东方红',
        '老丛私房姜花香','九大香型','十年陈窖藏鸭屎香','十年陈窖藏蜜兰香']

word_dict = {'金香鸭屎+庄园蜜兰':'鸭屎蜜兰','金香鸭屎+清香桂花':'鸭屎桂花','庄园鸭屎+岽顶蜜兰香':'鸭屎岽顶','庄园鸭屎+庄园锯朵仔':'鸭屎锯朵',
        '金香鸭屎':'金香鸭屎','庄园鸭屎':'庄园鸭屎','庄园蜜兰':'庄园蜜兰','岽顶蜜兰香':'岽顶蜜兰香','浓香芝兰':'浓香芝兰','庄园锯朵仔':'庄园锯朵','清香鸭屎':'金香鸭屎','清香桂花':'清香桂花','庄园东方红':'庄园东方红','悠山蜜兰':'悠山蜜兰','老丛私房鸭屎香':'老丛私房鸭屎香',
        '老丛私房蜜兰香':'老丛私房蜜兰香','六大香型300g':'六大','六大香型进阶版':'六大进阶','四大老丛':'四大老丛','老丛私房八仙':'老丛私房八仙','老丛私房凹富后':'老丛私房凹富后','老丛私房宋种':'老丛私房宋种','老丛私房东方红':'老丛私房东方红',
        '老丛私房姜花香':'老丛私房姜花香','九大香型':'九大','十年陈窖藏鸭屎香':'十年陈鸭屎香','十年陈窖藏蜜兰香':'十年陈蜜兰香'}

f = open('Untitled-1.json', 'r', encoding='utf-8')

data = json.load(f)

f.close()

# print(data['mainOrders'][0]['id'])
# print(data['mainOrders'][0]['subOrders'][0]['itemInfo']['skuText'][1]['value'])

for obj in data['mainOrders']:
    # print(obj['id'])
    # print(obj['subOrders'][0]['itemInfo']['skuText'][1]['value'])
    order_id = obj['id']
    order_value = obj['subOrders'][0]['itemInfo']['skuText'][1]['value']


    for w in word:
        if w in order_value:
            order_value = word_dict[w]
            print(order_id, end=' ')
            print(order_value)
            break